{
  "intents": [
      {
          "tag": "greeting",
          "patterns": ["Hello", "Hi", "Hey", "Salut", "Bonjour"],
          "responses": ["Salut à toi!", "Hello!", "Comment ça va?", "Salutations!", "Enchanté", "Salut ! Comment puis-je vous aider aujourd'hui ?"]
      },
      {
          "tag": "age",
          "patterns": ["Quel âge as-tu?", "C'est quand ton anniversaire?", "Quand es-tu né?"],
          "responses": ["J'ai 25 ans", "Je suis né en 1996", "Ma date d'anniversaire est le 3 juillet et je suis né en 1996", "03/07/1996"]
      },
      {
          "tag": "date",
          "patterns": ["Que fais-tu ce week-end?", "Tu veux qu'on fasse un truc ensemble?", "Quels sont tes plans pour cette semaine"],
          "responses": ["Je suis libre toute la semaine", "Je n'ai rien de prévu", "Je ne suis pas occupé"]
      },
      {
          "tag": "name",
          "patterns": ["Quel est ton prénom?", "Comment tu t'appelles?", "Qui es-tu?"],
          "responses": ["Mon prénom est Miki", "Je suis Miki", "Miki"]
      },
      {
          "tag": "goodbye",
          "patterns": ["Au revoir", "Goodbye", "Ciao", "Adieu", "À plus tard"],
          "responses": ["C'était sympa de te parler", "À bientôt!", "On se reparle très vite!"]
      },
      {
          "tag": "problem_wifi",
          "patterns": ["Mon wifi ne fonctionne pas", "Problème de connexion Wifi", "Pas de connexion Internet"],
          "responses": ["Redémarrez votre routeur et votre ordinateur.", "Vérifiez que vous êtes connecté au bon réseau Wi-Fi.", "Contactez votre fournisseur de services Internet."]
      },
      {
          "tag": "startup_issue",
          "patterns": [
              "Mon ordinateur ne démarre pas.",
              "Mon PC ne s'allume pas.",
              "Problème de démarrage de l'ordinateur."
          ],
          "responses": [
              "Assurez-vous que l'alimentation est branchée.",
              "Vérifiez les connexions électriques.",
              "Essayez de redémarrer l'ordinateur en maintenant le bouton d'alimentation enfoncé pendant quelques secondes."
          ]
      },
      {
          "tag": "virus_issue",
          "patterns": [
              "Comment supprimer un virus de mon ordinateur ?",
              "Mon ordinateur est infecté par un malware.",
              "Besoin d'aide pour éliminer un virus."
          ],
          "responses": [
              "Utilisez un logiciel antivirus pour scanner et supprimer les virus.",
              "Mettez à jour votre logiciel antivirus pour une meilleure protection.",
              "Évitez de télécharger des fichiers suspects ou de cliquer sur des liens non fiables."
          ]
      },
      {
          "tag": "wifi_issue",
          "patterns": [
              "Mon Wi-Fi ne fonctionne pas.",
              "Comment résoudre les problèmes de connexion Wi-Fi ?",
              "Pas de connexion Wi-Fi sur mon ordinateur."
          ],
          "responses": [
              "Donnez-moi plus de détails pour que je puisse vous aider.",
              "Redémarrez votre routeur et votre ordinateur.",
              "Vérifiez que vous êtes connecté au bon réseau Wi-Fi.",
              "Essayez de réinitialiser les paramètres réseau de votre ordinateur."
          ]
      },
      {
          "tag": "error",
          "patterns": [
              "Erreur",
              "Problème inconnu",
              "Quelque chose s'est mal passé."
          ],
          "responses": [
              "Quelque chose s'est mal passé, veuillez essayer de recharger la conversation."
          ]
      },
      {
        "tag": "other_issues",
        "patterns": [
            "Comment réparer un écran bleu sur mon ordinateur ?",
            "Comment récupérer des fichiers perdus sur mon disque dur ?",
            "Comment augmenter la vitesse de mon ordinateur ?",
            "Comment résoudre les problèmes de son sur mon ordinateur ?",
            "Comment nettoyer mon clavier d'ordinateur ?",
            "Comment protéger mon ordinateur contre les logiciels malveillants ?",
            "Comment résoudre les problèmes d'impression sur mon ordinateur ?",
            "Comment désinstaller un programme sur mon ordinateur ?",
            "Mon navigateur internet se bloque fréquemment.",
            "Comment récupérer un mot de passe oublié sur mon compte utilisateur ?",
            "Comment mettre à jour les pilotes de mon ordinateur ?",
            "Mon écran d'ordinateur affiche des lignes colorées.",
            "Comment vérifier l'état de santé de mon disque dur ?",
            "Comment empêcher mon ordinateur de surchauffer ?",
            "Comment changer le fond d'écran de mon ordinateur ?",
            "Mon clavier d'ordinateur ne fonctionne pas correctement."
        ],
        "responses": [
            "Assurez-vous que l'alimentation est branchée. Vérifiez les connexions électriques. Essayez de redémarrer l'ordinateur en maintenant le bouton d'alimentation enfoncé pendant quelques secondes.",
            "Utilisez un logiciel de récupération de données pour tenter de récupérer les fichiers perdus. Évitez d'écrire de nouvelles données sur le disque dur pour augmenter les chances de récupération réussie.",
            "Supprimez les fichiers inutiles et les programmes indésirables. Mettez à jour les pilotes de votre matériel. Ajoutez de la mémoire RAM si nécessaire. Évitez d'exécuter trop de programmes en même temps.",
            "Vérifiez que les haut-parleurs ou les écouteurs sont correctement connectés. Assurez-vous que le volume du système et du programme est suffisamment élevé. Mettez à jour les pilotes audio si nécessaire.",
            "Éteignez l'ordinateur et débranchez le clavier. Utilisez un chiffon doux et sec pour essuyer les touches. Utilisez un peu d'alcool isopropylique pour enlever les taches tenaces.",
            "Installez un logiciel antivirus de confiance et mettez-le à jour régulièrement. Évitez de télécharger des logiciels piratés ou provenant de sources non fiables. Soyez prudent avec les e-mails et les pièces jointes provenant d'expéditeurs inconnus.",
            "Vérifiez que l'imprimante est correctement connectée et alimentée. Assurez-vous que le pilote d'imprimante est installé et à jour. Réessayez d'imprimer ou redémarrez l'imprimante si nécessaire.",
            "Allez dans le Panneau de configuration, puis dans Programmes et fonctionnalités. Sélectionnez le programme que vous souhaitez désinstaller et cliquez sur 'Désinstaller'.",
            "Effacez le cache et les cookies de votre navigateur. Mettez à jour votre navigateur vers la dernière version. Si le problème persiste, essayez d'utiliser un autre navigateur.",
            "Si vous avez configuré une option de récupération de mot de passe (comme une adresse e-mail de secours ou un numéro de téléphone), utilisez-la pour récupérer votre mot de passe. Sinon, contactez le support technique du service concerné.",
            "Allez dans le Gestionnaire de périphériques, sélectionnez le périphérique dont vous souhaitez mettre à jour le pilote, cliquez avec le bouton droit de la souris et choisissez 'Mettre à jour le pilote'.",
            "Ce problème peut être causé par un mauvais contact entre l'écran et l'ordinateur, ou par un dysfonctionnement du matériel. Vérifiez les connexions et contactez un technicien si nécessaire.",
            "Utilisez un logiciel de diagnostic de disque dur pour vérifier l'état de santé de votre disque dur. Recherchez les erreurs et les secteurs défectueux.",
            "Assurez-vous que les ventilateurs de refroidissement de l'ordinateur fonctionnent correctement. Évitez de bloquer les évents d'aération. Nettoyez régulièrement la poussière accumulée à l'intérieur de l'ordinateur.",
            "Faites un clic droit sur le bureau, puis choisissez 'Personnaliser'. Sélectionnez l'image que vous souhaitez utiliser comme fond d'écran.",
            "Vérifiez que le clavier est correctement connecté à l'ordinateur. Redémarrez l'ordinateur. Si le problème persiste, essayez d'utiliser un autre clavier."
        ]
    }
    
  ]
}
